[
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 21:6",
		"devo_title": "Weekly Truth",
		"devo_summary": "\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the key verse for the book of Revelation.\n\nThen he said to me, “It is done! I am the Alpha and the Omega, the beginning and the end.”\n\n—Revelation 21:6\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-3.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Psalm 113:1–3",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nHallelujah!\n\nGive praise, servants of the LORD;\n\npraise the name of the LORD.\n\nLet the name of the LORD be blessed\n\nboth now and forever.\n\nFrom the rising of the sun to its setting,\n\nlet the name of the LORD be praised.\n\n—Psalm 113:1–3\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day20.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 22:1-21, Psalm 12:6, Ezekiel 47:1-12",
		"devo_title": "The Source of Life",
		"devo_summary": "\nThere’s a phrase we use in our house often. My kids can recite it by heart. It first came about when my son asked me if Indiana Jones got crushed by the giant boulder. He had never seen Raiders of the Lost Ark, a problem I remedied as quickly as possible. But he knew Indy had to run from a boulder, and he wanted to know how that ended. I refused to tell him, saying he needed to discover that on his own. He said, “Why won’t you just tell me?” My answer, and the phrase we’ve all since memorized, was this: “Let the storyteller tell the story in the way they want to tell it.”\n\nIn other words, let’s not spoil the ending. Let’s get there honestly. Let’s let others do the same. If you jump to the ending, you may discover what happens, but you will have missed so much of the context for why it matters.\n\nHere we are, in the last chapter, not only of Revelation, but of the entire Bible. Revelation 22 tells us that Jesus is coming again, and soon (vv.7,20). With that promise comes a call for believers to “keep the words of the prophecy of this book” (v.8). Those two details carry so much importance in light of the context of the book of Revelation, and the whole of Scripture. How so?\n\nJesus is coming again. When we go all the way back to the beginning of the Bible, we find God at work creating everything we know and calling it good. We see Him make mankind in His image, and we see humanity rebel against Him. Then we hear the clink of the flaming swords of Eden as our first parents are cast out of the garden. What follows is an ongoing struggle between God and His people. Will we ever be reconciled? Will that reconciliation be the kind that lasts? Revelation 22 reveals the answer: Yes.\n\nUntil that day, we are to “keep the words of this book” (v.9). What will God’s reconciling work in Christ look like? Will it be empty tolerance, or intimate affection? The call to obey Scripture reassures us that God’s eternal plan for His people is one of relational intimacy. We are not merely tolerated by God. We are loved. We are kept. We will live in an ongoing eternal relationship with Him, and in this life, we practice the life to come by seeking to live according to the Word of our God, who does not change.\n\nThis is how the Storyteller has told the story. We are called to persevere in obedience and live in light of the reality that Jesus is coming back, knowing that when He does, it will be as a Bridegroom coming for His Bride. And all will be well. Forever.\n\n“Amen! Come, Lord Jesus!” (Revelation 22:20).\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day19.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 21:1-27, 1 Corinthians 15:42-49, Colossians 3:1-4",
		"devo_title": "The New Creation",
		"devo_summary": "\nDo you watch Jeopardy? You know, it’s the quiz show where the answer is provided, and the contestant’s job is to guess the question. Let’s play.\n\nAnswer: “Then the one seated on the throne said, ‘Look, I am making everything new’” (Revelation 21:5).\n\nQuestion: What has the entire story of Scripture been building up to since the garden of Eden and the fall of man?\n\nThis might just be my favorite verse in the entire Bible, when John writes about the loud voice he hears from the throne of heaven proclaiming the renewal of all things. When the One seated on the throne—the risen Jesus—says that He is making all things new, He is addressing the undoing of all that was lost when our first parents turned away from God in Eden. He is proclaiming the reach of His redemptive work. He is celebrating the power He alone wields. And He is giving those who believe in Him the greatest assurance we could ever hope to hear—that every struggle, weakness, grief, and cause for suffering will be done away with, once and forever.\n\nI read an article the other day where a seminary president said it wasn’t necessary to believe in a literal bodily resurrection, and that the purpose of Easter was to inspire us all to be better people to one another. What an empty take on the finished work of Christ. And what a tragic omission of the testimony of Scripture. John’s vision in Revelation is far from metaphorical. Sure, some of the imagery carries metaphorical meaning, but the end of the story is anything but metaphor. Everything will be made new. The old order of things will pass away. Forever. For real.\n\nOne of the marks of this new creation will be the presence of Christ Himself in the middle of it all. He will be the light, the ruler, the King. This will not be a metaphorical presence, but the most vivid, actual, tangible presence any of us has ever known. How it will all work is veiled in mystery, but what the book of Revelation labors to make plain is that when Christ ushers in His eternal kingdom, it will be real, eternal, glorious, and perfect.\n\nAnd it will be the perfect conclusion to the unfolding drama of the human story—the fall of humanity undone by the finished work of Christ. On that day, all of God’s people will be restored to face-to-face relationship with our Creator God, the one we were meant to know and enjoy forever. This is what’s coming. To God be the glory.\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day18.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 19:1-21, Revelation 20:1-15, Isaiah 25:6-9, Isaiah 54:5-7, Ephesians 5:25-27",
		"devo_title": "Celebration in Heaven",
		"devo_summary": "\nI am a pastor, and every week in our church we come to the communion table. Though I sometimes feel an internal pressure to try to keep my words fresh and the invitation to the table interesting, I find that I return to a few key ideas that I express in roughly the same way every week. One of those truths comes from today’s text.\n\nAs we prepare to rise from our seats to come forward to receive the bread and cup, I remind the congregation that this table won’t last forever. One day, the communion table will become a relic of a bygone era—something we used to do. Why? Because of what we read in Revelation 19:6–10. The communion table will be replaced by the marriage supper of the Lamb. Instead of a single bite and tiny sip, a feast will spread out before us. Instead of having our appetites awakened by the tease of the bread and cup, we will have our appetites satisfied by an unimaginable banquet spread, never to hunger again.\n\nThe host of the meal will be the same—Christ Jesus. And the people gathered around the table will also be the same—all believers everywhere. But the nature and meaning of the meal will shift, or maybe a better way to say it is that it will reach its fulfillment.\n\nChristians are a people in waiting, a Bride expecting the final return of the Bridegroom. Now we gather in worship, come to the communion table, and pray as our Lord taught us: “Your kingdom come, Your will be done on earth as it is in heaven” (Matthew 6:10). But one day, Christ will come, and His return will kick off a wedding feast the likes of which this world has never seen.\n\nThe Church is the Bride, and because of Christ we are clothed in purity, with nothing held against us, nothing preventing us from looking our Redeemer fully in the eye. It is difficult—no, impossible—to fully imagine His coming glory from where we’re sitting now. But when John heard the angel describe it, he fell down in awe. Imagine what it will be like in person!\n\nThe communion table is not the only thing that will reach the end of its usefulness. So will our wandering, our duplicitous hearts, our finicky appetites, and our wavering devotion. We will be changed, draped in the glory of Christ, and given a place in His eternal presence as His beloved. If you are a believer in Christ, there is no reality more certain than this.\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day17.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 18:1-24, Isaiah 52:11, Jeremiah 51:47-50 ",
		"devo_title": "The Fall of Babylon",
		"devo_summary": "\nIn the fall of 2008, I was a senior in high school applying to colleges and looking for scholarships. Right before Christmas, I decided to attend a private Christian college near my hometown instead of a public state university a few hours away. I knew that the Christian college was going to be a lot more expensive, but my parents said that as long as I earned enough scholarship money, they would be able to afford it.\n\nThen, in January 2009, just a few months after I’d decided to attend the expensive school instead of the more cost-effective one, my dad lost his job. He had worked at IBM for more than 25 years. Why did a manager at one of the top companies in the world lose his job in 2009? The same reason a lot of his peers did: the Great Recession.\n\nThe recession of 2008–2009 affected the lives of millions of Americans. Over the course of the recession, nearly nine million Americans lost their jobs, and about 818,000 of them lost their jobs in a single month—January 2009, when my dad lost his.\n\nThe Great Recession showed America and the world that even the biggest companies can be toppled by forces beyond their control. No one is untouchable. Revelation 18 reminds us of a similar truth. Even the greatest worldly powers will not stand against the rule and reign of Almighty God when all is said and done.\n\nThe prostitute in Revelation 17 is now called “Babylon the Great” here in Revelation 18. And it is in this chapter that John tells us of her demise. He says, “Then I heard another voice from heaven: ‘Come out of her, my people, so that you will not share in her sins or receive any of her plagues. For her sins are piled up to heaven, and God has remembered her crimes’” (vv.4–5).\n\nRegardless of what we may believe about the literal meaning of Babylon the Great, this principle is true: the fall of Babylon shows us that even the strongest, most powerful worldly structures will crumble and fall at the feet of Jesus.\n\nBabylon opposed the work of Christ in the world. In human terms, Babylon seems impenetrable and all-powerful. Yet, when God pours out His wrath, even this seemingly invincible entity cannot bear the weight.\n\nWe must resist the temptation to seize power and control in the world around us as an act of disobedience to God our Father. In our sin, we will be tempted to build our own empires in our lives, ones we want to rule apart from, and therefore in opposition to, the rule and reign of God. But no system we create, business we launch, or family we grow is more important than the family and mission of God.\n\nWritten by Chris Martin\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day16.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 17:1-18, Psalm 90:1-17, 1 Timothy 6:11-16 ",
		"devo_title": "The Woman and the Scarlet Beast",
		"devo_summary": "\n“These will make war against the Lamb, but the Lamb will conquer them because he is Lord of lords and King of kings. Those with him are called, chosen, and faithful” (Revelation 17:14).\n\nPower is our ability to make change, to make a difference, for good or for bad. In the wrong hands, it can be dangerous, even deadly. But if the one wielding power is good, trustworthy, and just, incredible things are possible. In his book, Playing God, Andy Crouch states that power is “both better and worse than we could imagine… Power, the truest servant of love, can also be its most implacable enemy.”\n\nAs human beings, we often crave power, because with power comes control. With control comes the ability, or, perhaps more appropriately, the illusion of the ability to determine our life’s outcomes. We believe a lie that says the more power we acquire, the more likely we are to achieve our own idea of success, whatever that may be. The problem is, seizing power to yield success doesn’t ever work out the way we think it should. Our sinful hearts want to hijack that power for our own gain, however pure we believe our motives. Revelation 17 shows us how this story ends.\n\nWithout getting caught up in the identity of the prostitute, the beast, or the meanings of their descriptions. What’s important for us to take away from Revelation 17 is this: Worldly power is dangerous, and our pursuit of it can lead to our ultimate destruction. Too often, our pursuit of power is rooted in selfish purposes.\n\nWe want power to gain money.\nWe want power to gain control.\nWe want power to make life easier.\nWe want power to gain fame.\nWe want power to benefit ourselves instead of others.\n\nGod demonstrated His power by sending His Son to die for us. The most powerful action in the history of the universe is seen in Jesus’s death and resurrection. He took the throne by dying, not killing.\n\nOur understanding of how power is acquired and our reasons for wanting it are both warped by our sin. If we pursue power for ourselves through worldly means, it will be our destruction. By “winning” in this way, we will inevitably lose. Worldly power is fleeting and dangerous. But one day Jesus, the Lamb, will conquer all rulers and kingdoms, and His followers will share in His victory. It is through our weakness that Christ’s perfect power is realized (2 Corinthians 12:9–11). It is in His victory that we, too, are victorious. “To him be honor and eternal power. Amen” (1 Timothy 6:16).\n\nWritten by Chris Martin\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day15_.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 16:7",
		"devo_title": "Weekly Truth",
		"devo_summary": "\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize a reminder of God’s power and justice.\n\nYes, Lord God, the Almighty,\n\ntrue and just are your judgments.\n\n—Revelation 16:7\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-2.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Psalm 107:1-3",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nGive thanks to the LORD, for he is good;\n\nhis faithful love endures forever.\n\nLet the redeemed of the LORD proclaim\n\nthat he has redeemed them from the power of the foe\n\nand has gathered them from the lands—\n\nfrom the east and the west,\n\nfrom the north and the south.\n\n—Psalm 107:1–3\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day13.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 15:1-8, Revelation 16:1-21, Exodus 15:1-18",
		"devo_title": "The Seven Bowls",
		"devo_summary": "\nThis time of year always reminds me of the Memorial Day Weekend tornado that hit my Northeast Indiana hometown when I was a kid. Spring and summer brought severe weather to the area from time to time. I remember this tornado because it was one of the only tornado warnings that led us to go to our basement for cover. We were often warned about tornadoes in the springtime, but rarely did those warnings result in an actual tornado on the ground anywhere near our house. This one, however, touched down on one of the major thoroughfares in our small city, about five miles away from my house. It was for real, and the sky was as black as I have ever seen it. I remember looking out my front door toward the direction of the tornado before we shuffled down into the basement.\n\nTornadoes always make me think of the wrath of God. We don’t see any explicit examples of God using tornadoes in the Bible as a demonstration of His wrath, but we see plenty of examples of Him demonstrating His lordship over creation by how He pours out His wrath on the rebellious. Revelation 15–16 gives us some of the clearest biblical examples this.\n\nIn chapter 15, John describes a vision in which he sees a group of seven angels with the last seven plagues, through which the wrath of God will be completed (v.1). In addition to those angels, John sees “those who had won the victory over the beast… standing on the sea of glass with harps from God” (v.2). They sang a song to God, telling of His holiness and declaring that all nations will one day come and worship Him. Then out of the temple came the seven angels with the seven plagues in seven bowls, representing the ways God would pour out His wrath on the wicked for a final time.\n\nThe message of chapter 16 is clear: those who worship anyone but Yahweh will experience the wrath of God. One day, when His wrath is complete, “all the nations will come and worship before [Him]” when His righteous acts are revealed (v.4).\n\nGod’s righteous wrath displays His majesty and power, and He justly pours it out on all who have rebelled against Him in their worship of other gods. Inherent in each one of us is the desire to worship, but we are too easily satisfied by worshiping something or someone other than God. This sin separates us from the Lord, and it condemns us to experience His wrath instead.\n\nBut the story doesn’t end there.\n\nGod’s majesty is also on display in the tremendous sacrificial love He has shown us in the sacrifice of His Son. By sending His Son to live the perfect life we couldn’t live, die the death we deserve to die, and rise from the dead, God’s majesty is displayed in His gracious deliverance of His people. When we trust God and believe that our salvation relies completely on the finished work of Christ and not our future obedience, we are rescued from the wrath of God and freed to live in His presence. Thanks be to God!\n\nWritten by Chris Martin\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day12.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 14:1-20, Psalm 107:1-3, Hebrews 12:18-24",
		"devo_title": "The Proclamation of Three Angels",
		"devo_summary": "\nRevelation 14 is a chapter of extremes. It opens with the Lamb standing on Mount Zion with 144,000 men, pure and undefiled, and it ends with God’s enemies being judged, their mingled blood rising to the level of a horse’s bridle for a hundred and eighty square miles. Revelation is a book of symbols and metaphors, so it may be that John’s visions have been painted with a broad brush intentionally. We don’t necessarily have to take every word as a literal depiction of events that have unfolded or may yet unfold.\n\nFor example, there is nothing in Scripture that requires perpetual virginity in order to be considered clean before God, yet the 144,000 are said to be “ones who have not defiled themselves with women, since they remained virgins” (Revelation 14:4). It could be that virginity is being used as a symbol of devotion to God, something that we should all strive for, regardless of our marital status. The number 144,000 is also likely to be emblematic, since it’s the sum of twelve times twelve times a thousand. Twelve is the number of tribes in Israel and also the number of Jesus’s apostles, and a thousand is often used in Scripture to signify vastness. In addition, it is unlikely that the judgment of the wicked will take place in an actual winepress.\n\nReading this chapter through, I am struck by how perfectly understandable it all is, despite it being about as clear as mud! What I mean is that even though all the details are mysterious and perplexing, I know exactly where everyone stands. The 144,000 are followers of Jesus, faithful and true. And the grapes harvested and crushed in the winepress of God’s wrath? They’re those who have rejected Christ, who have delighted in wickedness and scoffed at the gospel of peace.\n\nIt’s fitting that between these two portions of Scripture there is a gospel proclamation delivered by an angel: “He spoke with a loud voice: ‘Fear God and give him glory, because the hour of his judgment has come. Worship the one who made heaven and earth, the sea and the springs of water’” (v.7). This angel is followed by two more: one with a declaration of Babylon’s destruction (v.8) and another with a summary of the punishment that will befall all those who worship the beast and take his mark (vv.9–11). There is God and life in the one hand, the beast and death in the other. Despite the confusion that surrounds the symbolism of this chapter, the angels have made the choice before every person quite clear.\n\nThis same decision stands in front of all the complex issues we face—theological, social, political, and everything in between. Before we answer any other questions, we must answer the most important one: Whose side am I on? The answer to that question will inform all the others, and it’s one we must continue to ask ourselves. It’s no wonder one of the angels says, “This calls for endurance from the saints, who keep God’s commands and their faith in Jesus” (v.12). Brothers, let us endure, for the way we answer this most important of questions has the power to shape every minute of every day for the rest of our lives.\n\nWritten by John Greco\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day11.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 13:1-18, Proverbs 1:7, Hebrews 10:32-39",
		"devo_title": "The Beast from the Sea and the Beast from the Earth",
		"devo_summary": "\nA much older friend once told me that when barcodes and checkout scanners were first introduced, she abandoned an entire shopping cart full of groceries at the front of the line and walked out of the supermarket. Back then, she was deeply engaged in popular end-times theology teaching and when she saw the new scanning technology being used, she feared it might somehow be related to the mark of the beast mentioned in Revelation 13:18.\n\nMy friend smiles at this today, as UPCs have become commonplace and proven themselves to be an innocuous bit of technology that saves us all time at the checkout counter. Even so, for centuries the mysterious reference to the mark, or number, of the beast has left Bible readers scratching their heads.\n\nMany people have tried to crack the code of six-sixty-six by calculating the names of various world leaders using numbers as stand-ins for letters. Others have seen the number as purely symbolic, representative of evil and chaos. One thing is for certain, the beast from the sea and the beast from the earth described in Revelation 13 are not our friends. They are in league with Satan himself and are intent on bringing harm to humanity.\n\nOne of the ways they do this is by deceiving people into worshiping the first beast (Revelation 13:8,12). The second beast is even said to perform “great signs, even causing fire to come down from heaven to earth” (v.13). If you’re familiar with the Old Testament book of 1 Kings, you’ll recognize that Elijah called down fire from heaven in his showdown with the prophets of Baal (1 Kings 18:30–40). At the time, the falling fire was a sign that Yahweh alone was God. But here in Revelation, it is a false prophet who calls down fire from heaven to “prove” the beast from the sea is worthy of worship. It’s no wonder people are deceived!\n\nAs John writes, “This calls for endurance and faithfulness from the saints” (Revelation 14:12). To stand strong in the midst of such deception, we must be anchored in the Word of God. We need to know the truth so we don’t fall for a lie when it is wrapped in persuasive arguments or false signs and wonders. That’s why it’s so important to be students of the Bible—not just for a season or when it fits into our busy schedules, but every day and for the rest of our lives.\n\nWe must be immersed in the truth, going deeper and wider all the time. It’s the only way to cultivate a discerning mind in a world bent on drawing us away from Christ. As an added benefit, being rooted in God’s Word will keep us from falling for every end-times fad, whether it’s an updated take on a Y2K scenario, mysterious Bible codes, or the barcode on the bottom of your cereal box.\n\nWritten by John Greco\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day10.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 12:1-18, Genesis 3:1-15, Colossians 2:13-15",
		"devo_title": "The Woman, the Child, and the Dragon",
		"devo_summary": "\n“There weren’t any dinosaurs at the manger,” my four-year-old, Jonah, argued. His younger brother Jude had begun mixing random toys into our VeggieTales nativity set, including one mean-looking stegosaurus. I didn’t have the heart to tell Jonah there probably weren’t any talking cucumbers in Bethlehem either.\n\nRevelation 12 doesn’t offer us a typical Christmas scene, but the chapter does include the birth of Christ, and there’s even a dinosaur—er, dragon. John sees a sign in the sky: a woman about to give birth and a fiery red dragon waiting to devour her Child. Clues in the text invite us to see the woman as Israel, the sun, moon, and stars being an early image of God’s people (see Genesis 37:9–11). The Son born to the woman is Jesus, the Messiah. The iron rod is the clue there (see Psalm 2:6–9). Finally, there is the dragon, whom John identifies as “the ancient serpent, who is called the devil and Satan, the one who deceives the whole world” (Revelation 12:9).\n\nJesus’s birth, life, death, resurrection, and ascension unfold quickly—so quickly in fact that a lot of readers miss it (see v.5). Unlike in the Gospels, the Revelation account of Jesus’s ministry is focused not on earth, but on what took place in the unseen realm.\n\nJesus paid the price for our sins on the cross, and when He walked out of the empty tomb on Easter morning, He triumphed over death. He did these things for us—on our behalf. As a result, the devil no longer has any claim on God’s people, no reason left to accuse us. We have been justified, made clean, forgiven. The price has been paid. As a result, Satan lost his place as prosecutor in God’s heavenly court (vv.8,10). Therefore, the archangel Michael and God’s angel armies waged war against the devil and his angels, and threw them down to earth. Satan has now been forced to change his strategy—from accusing God’s people to waging war against them (v.17).\n\nThat sounds like bad news at first, doesn’t it? We have an enemy who’ll stop at nothing to destroy us. But that’s not the way John frames it. In the middle of the action he includes a victory cry from heaven:\n\n“The salvation and the power \nand the kingdom of our God \nand the authority of his Christ \nhave now come, \nbecause the accuser of our brothers and sisters, \nwho accuses them \nbefore our God day and night, \nhas been thrown down” (Revelation 12:10).\n\nJesus has defeated Satan. Good has triumphed over evil. It’s the end of the story we’ve been waiting for. Only it isn’t the end.\n\nYou and I live between this great victory and the final battle, after which Satan will be thrown into the lake of fire (20:10). But we have been given this glimpse behind the veil separating heaven and earth so that when we hear the forces of evil roar, we might remember all is not lost. In fact, everything—absolutely everything—has been won, because of what Jesus accomplished. Satan’s time is short (12:12), and our redemption is near.\n\nWritten by John Greco\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day9.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 10:1-11, Revelation 11:1-19, Psalm 2:1-12, Daniel 2:36-44",
		"devo_title": "The Seventh Trumpet",
		"devo_summary": "\nDon’t put all your eggs in one basket.\n\nThe idiom is familiar to most of us, as is its meaning: if you depend completely on one thing and that thing doesn’t work out, then you’ve lost everything. The worldly wise spread things around a little—a single egg in this basket, two eggs in that one, a half dozen in this one over here. That way, if something goes wrong—and something usually does go wrong—you’ve got other eggs to fall back on, so to speak.\n\nMakes sense, doesn’t it? And so we diversify everything from our portfolios to our allegiances. A little faith in family and friends over here, and then maybe a little in politics over there. It just makes sense, except when it comes to God and His kingdom. As the apostle Paul reminds us in 1 Corinthians 3: “For the wisdom of this world is foolishness with God” (v.19).\n\nGod’s Word is clear. One of these days, one that is definitely not confined to our timetables, there will be a sudden realization, when “the kingdom of the world has become the kingdom of our Lord and of his Christ, and he will reign forever and ever” (Revelation 11:15).\n\nEverything we just knew was so certain and secure, like nations and kingdoms and political leaders and princes, will be revealed to have been temporary. Their power and rule, which often feels so comprehensive to us, is only effective here and now. Their power has boundaries, like the edges of one of our egg baskets. The kingdom of God, on the other hand, encompasses both heaven and earth. It knows nothing of boundaries or baskets. In fact, when it comes to all the plans of the rulers of the kingdoms of this earth, the psalmist shocks us by writing that “the one enthroned in heaven laughs” (Psalm 2:4).\n\nWhen it comes to something like our financial eggs, for example, yes—it is wise to diversify. But when it comes to our loyalties, true wisdom means placing our faith in the King who will reign forever. Until His kingdom comes in its fullness, we are to “serve the LORD with reverential awe and rejoice with trembling” (Psalm 2:11).\n\nWritten by John Blase\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day8.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 7:10",
		"devo_title": "Weekly Truth",
		"devo_summary": "\nScripture is God-breathed and true. When we memorize it, we carry the gospel with us wherever we go.\n\nThis week we will memorize the proclamation of the multitude in white.\n\nSalvation belongs to our God,\n\nwho is seated on the throne,\n\nand to the Lamb!\n\n—Revelation 7:10\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/4-HRTRevelation-1.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "1 Corinthians 15:54-57",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nWhen this corruptible body is clothed with incorruptibility, and this mortal body is clothed with immortality, then the saying that is written will take place:\n\nDeath has been swallowed up in victory.\n\nWhere, death, is your victory?\n\nWhere, death, is your sting?\n\nThe sting of death is sin, and the power of sin is the law. 57 But thanks be to God, who gives us the victory through our Lord Jesus Christ!\n\n—1 Corinthians 15:54–57\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day6.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 8:1-13, Revelation 9:1-21, 1 Peter 3:8-12, 1 Corinthians 15:51-52",
		"devo_title": "The Trumpets",
		"devo_summary": "\nI was raised the first-born son of a Southern Baptist preacher. There was a memorable season in my boyhood when my father preached through the book of Revelation, chapter by chapter, verse by verse. This undertaking was no doubt spurred on by questions his congregation had regarding some popular writings of the era, the 1970s. I remember him delivering passionate sermons backdropped by a huge timeline chart on the wall, which gave structure to the events of the last days.\n\nWhen I was a boy, I thought as a boy. So most of what I remember of that time is my father’s physical presence behind a pulpit and the incredible imagery of this final book of the Bible. My mind was captured by visions of blood reaching up to a horse’s bridle, seals opened and trumpets blasting, lakes of fire—to name a few. And then there’s this:\n\n“The smoke of the incense, with the prayers of the saints, \n\nwent up in the presence of God from the angel’s hand” (Revelation 8:4).\n\nAnd while my father had a particular interpretation of it all, the most important thing impressed upon me was the need to make sure I was on God’s side in the apocalypse. The alternative, to my boy’s mind, was chilling.\n\nToday, I look at the book of Revelation a bit differently than my dad did back then. But the impression he made on me? I remain held in its grip to this day. I confess I do not understand all that’s going on in John’s vision. Some of it is possibly historical, some possibly literal, some no doubt figurative and poetic, and some of it yet to come to pass. All of it remains quite chilling.\n\nRegardless of how you approach this book, it’s difficult to deny that everything in the vision moves toward a clear loser and clearer winner. The revelation is God Himself, and here’s the good news: He wins. And here’s one impression we should each walk away with: our only hope—quite literally, in the culmination of all things—is Jesus. It is good to ensure we are on God’s side, not just in the already-has-been or yet-to-come apocalypse, but also in the very real right here and now. And right now, “the eyes of the Lord are on the righteous and his ears are open to their prayer” (1 Corinthians 15:52). While we wait for His return, we have His ear, His attention. But does He have our hearts?\n\nFor we know the rest of the story: God wins. The trumpet will blow. And in a moment, in the twinkling of an eye, at the last trumpet… we will be changed” (1 Corinthians 15:51–52).\n\nWritten by John Blase\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day5.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 6:1-17, Revelation 7:1-17, Psalm 13:1-6, Ephesians 1:11-14",
		"devo_title": "How Long, O Lord?",
		"devo_summary": "\nOne click. That’s all it takes, and what I want (maybe even need) will be delivered to my doorstep. How long will this take? Two days. Forty-eight hours. Even sooner, if I’m willing to pay a little more. This option exists for almost any item imaginable, from roller ball pens to car batteries to groceries. The latest app trends for takeout aren’t just for fast-food but also restaurant fare, delivered right to my door. And how long will this take? Some services have set the bar at less than twenty-eight minutes—just 1,680 seconds. That’s crazy fast. But that’s the world we live in today.\n\nFifty-eight. That’s the number of people killed in the Las Vegas shooting in 2017. Remember that one? Add to that number the ongoing death and suffering of school shootings, natural disasters, disease and sickness, hunger and poverty, wars and rumors of wars—the tally is overwhelming. We look for something to click, some app to engage with to bring quick relief from the reality of pain, all the king’s horses and men—but there’s nothing. That’s also the world we live in. If we’re honest, it’s gotten a little old; the numbing feels empty. And still we cry, “Lord, how long…? Forever?”\n\nIt’s hard to hold on to hope in these competing worlds. The easy way out, the broad road? Give in to the one-click reality and numb ourselves as much as possible with whatever we can get. But the narrower way—the way that leads not just to a fix here and there, but to the full redemption of all things, including us—that’s what I call one-day living. It requires a dogged patience and trust in the Lord’s promises that one day, He will make all things right. One day…\n\nThey will no longer hunger;\nthey will no longer thirst;\nthe sun will no longer strike them,\nnor will any heat.\n– Revelation 7:16\n\nThat is not the world we live in right now. But it is the world that is coming. We need patience as we await our full redemption, but it’ll be worth the wait. How long will this take? That’s God’s call. Ours is to keep faith and to wait until we see.\n\nWritten by John Blase\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day4.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 4:1-11, Revelation 5:1-14, Isaiah 6:1-6, Ezekiel 1:26-28",
		"devo_title": "The Lamb Is Worthy",
		"devo_summary": "\nI love when it’s my birthday, but I don’t love when it’s time for everyone to stare at me and sing. What am I supposed to do? Sit there and soak in the awkwardness? Make a joke? Sing along? That small moment of super-concentrated attention is just too much. It’s odd to have everyone focused on you and singing to you, about you, for you. But it’s not odd for Jesus.\n\nThe angels and elders singing to Jesus, about Jesus, and for the glory of Jesus is exactly what Jesus deserves. This moment in Revelation isn’t too big for Him; He is worthy of it and so much more.\n\nThe apostle John sees what we need to see and believe again and again: Jesus is worthy of all praise, glory, honor, blessing, and power. He is worthy of it all, and He deserves it from all people. Many people are fine saying that Jesus is worthy of affirmation and honor, on the same level as other religious teachers. Revelation 4–5 says otherwise. Jesus is worthy to reign over the universe, bring history to its conclusion, and usher in the new heavens and the new earth. He is worthy of all that is worthy of God.\n\nAnd there’s more we need to see here.\n\nJesus is worthy of receiving glory, praise, and honor from us, brothers. Right now. Today, tomorrow, and for the rest of your life on into eternity. Jesus is worthy. Give Him praise. He was slaughtered for your sins, rose in victory, and loves you relentlessly. Anything you detect in your life that is dishonoring to Christ, repent of it today. Turn from it. Relent and give honor to Christ.\n\nWe may believe that Jesus is worthy, but do we live like we know it is true? All hail the Lamb who takes away our sin!\n\nWritten by J.A. Medders\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day3.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 2:1-29, Revelation 3:1-22, Matthew 22:34-39 ",
		"devo_title": "The Seven Churches",
		"devo_summary": "\nOur ideas for what church should be like should not be trusted. At least not totally. We can dream up all kinds of helpful strategies, plans, and programs, but we cannot overlook the all-important question: What does Jesus want for His Church? Today’s reading points us in the right direction.\n\nJesus dictated these letters to John and wanted them sent to the actual churches in these actual places in Asia Minor. And they stand today as ever-relevant words from Jesus about what He wants in all of His churches—in every place, every time, every nation.\n\nWhen we think about the kind of church we want to be a part of, what Jesus says in these seven letters should inform our search criteria. As we serve in our local churches, these letters offer the vision we should have for our churches. Jesus’s plan for His Church is far more significant than any conference, book, or pastor’s five-year goals. Jesus bought the Church with His own blood. Your church is His Church.\n\nSo what does Jesus want us to be?\n\nChrist wants Christ-centered churches (Letter to Ephesus). He wants churches that will endure the pressure and persecution from the surrounding culture (Letter to Smyrna). He wants churches committed to sound, healthy, biblical doctrine (Letter to Pergamum). The Lord wants churches that don’t minimize sin and worldliness (Letter to Thyatira). The risen Christ wants churches that avoid hypocrisy like we avoid the slow lane on the highway (Letter to Sardis). Jesus wants His churches to hold fast in ministry and endure till the end (Letter to Philadelphia). And finally, Jesus wants His Church to be a repenting Church, one that constantly returns to Him (Letter to Laodicea).\n\nThese letters are given to specific churches, but they are also for all churches, for all time. That’s why Jesus said, “Let anyone who has ears to hear listen to what the Spirit says to the churches” (Revelation 2:29). He wants us to listen, to learn, to repent and turn back to Him, our first love (v.4).\n\nWritten by J.A. Medders\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day2.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Revelation 1:1-20, 1 Corinthians 15:54-57, 1 Thessalonians 4:13-17\t ",
		"devo_title": "The Living One",
		"devo_summary": "\nImagine the smell of diesel smacking on concrete. Remember a time you opened the lid to your grill and the heat cocooned inside slammed into your face. (You probably lost some arm hair too.) Think about that one thunderclap you heard, then felt, in the middle of the night. These events and the vision of Jesus in Revelation chapter 1 all have something in common.\n\nPower. Awe. Fear.\n\nThe apostle John’s vision, also known as the Revelation of Jesus Christ, kicks off with exactly that: a vision of Jesus Christ. But this experience of Jesus is different than the one that prompted John to write the Gospel that bears his name. This vision of Jesus is cranked to eleven—eleven-hundred volts of power and glory.\n\nRevelation opens with a picture of Jesus that should wake us up, jolt us. It ought to make us sit back in awe and lean forward in thanksgiving. The one whose eyes are like a flame of fire (all-seeing), the one who has a sword coming out of this mouth (His words pronounce judgments), and the one whose hair is a brilliant white (totally wise)—He is the one who loves us, who saved us, the one who has made us His own.\n\nJohn’s vision of the risen Lord Jesus reminds us of something we are prone to forget—Jesus is full-strength God. Just because Jesus was crucified, don’t think He’s a pushover. He’s not weak. He tells us: “I am the First and the Last, and the Living One. I was dead, but look—I am alive forever and ever, and I hold the keys of death and Hades” (Revelation 1:17–18). He is in charge. He alone oversees the living and the dead for all eternity.\n\nJesus is more than a great speaker. He’s more than some kind of guru who gives out sage advice for how to live well on this planet. He is the First. The Last. It’s all about Him. Is this how you view Jesus? Is this how you treat Jesus? Is this how you worship Jesus? Do you have this kind of faith and trust and dependency on the one whose voice is like the sound of rushing waters? (14:2). Look to Him again. Let the heatwaves from Revelation 1 revive your heart for Jesus again.\n\nWritten by J. A. Medders\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2019/05/HRT-Revelation-Instagram-Day1.jpg"
	},
	{
		"book_title": "Jude & Revelation",
		"devo_passages": "Jude 1:1-25",
		"devo_title": "Chapter 1",
		"devo_summary": "",
		"img_url": ""
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Titus 3:5",
		"devo_title": "Weekly Truth",
		"devo_summary": "\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\n\nThis week we will memorize the key verse for the book of Titus. \n\nHe saved us—not by works of righteousness that we had done, but according to his mercy—through the washing of regeneration and renewal by the Holy Spirit.\n\n—Titus 3:5\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day.\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/4-TimothyTitus-3.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Hebrews 6:17-19",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nBecause God wanted to show his unchangeable purpose even more clearly to the heirs of the promise, he guaranteed it with an oath, so that through two unchangeable things, in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us. We have this hope as an anchor for the soul, firm and secure.\n\n—Hebrews 6:17-19\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day20.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Titus 3:1-15, 2 Corinthians 1:3-11, Ephesians 2:8-10",
		"devo_title": "Christian Living",
		"devo_summary": "\nJust a few miles down the road from where I lived in Philadelphia was a famous, privately owned art collection. The man who owned this collection of rare paintings stipulated in his will that no one should be allowed to alter them. The problem was that he stored many of these paintings in the boiler room of his home. Over the years, the coal from the furnace left them tarnished. \n\nAfter he died, his family made the executive decision to breach his will and have these paintings professionally restored. This was certainly the right decision as his home is now one of the most famous art museums in the world, hosting some of the most rare and wonderful works of art in the world. \n\nIn many respects, we, by nature, are all like those tarnished paintings. We need God to restore His image in us by the saving grace and work of Christ.\n\nThe Scriptures are clear that salvation is by grace alone through faith alone in Christ alone. There is absolutely nothing we contribute to our salvation other than the sin that makes it necessary. However, when God redeems individuals through the saving work of Christ and the regenerating work of the Spirit, He begins to restore His image in them. God doesn’t save us by our good works, but He saves us so that we would be zealous for good works. After all, we are His artwork of grace, designed to display His own glory in us (Ephesians 2:10).\n\nIn the same way as the paintings in the boiler room needed to be professionally restored, so Christ restores the image of God in His redeemed people. He alone can do this since He is Himself the very image of God. Just as Jesus went around doing good, so those who are united to Him by faith, washed in His blood, and filled with His Spirit are to seek to do good. \n\nWe need to be reminded that this is God’s purpose for us. If the paintings in the boiler room had been left alone, they would be of no good to anyone. God has appointed ministers to continually encourage His people to do good and to be ready for every good work. It is in this way that God displays the glorious artwork of His grace to a world full of those who likewise need to undergo that same restoration in Christ.\n\nWritten by Nick Batzig\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day19.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Titus 2:1-15, Malachi 3:17-18, 1 John 3:2-3",
		"devo_title": "Sound Teaching",
		"devo_summary": "\nBefore I went to seminary, I worked for a rental car company. I had a cubicle in their administrative offices. It was a great job for a number of reasons, and I was actually good at what I did. So good, in fact, that they knew I was leaving and promoted me anyway—six months before I left for seminary.\n\nI don’t tell you this story to brag, but to explain why I was able to have the most coveted cubicle in my department. It was away from everyone else and over by the printer, so I was by myself but never really alone. And since I was by myself, I could listen to music and sermons. Back in those days, I was listening to lots of sermons on cassette tapes, but I can only remember one. The preacher’s text was from Titus 2: “For the grace of God has appeared that offers salvation to all people. It teaches us to say, “No” to ungodliness…” (vv. 11-12). \n\nHis thesis was that we are conditioned to look at the gospel as the way to enter into the Christian life, but then we look to the law to make us holy. It is the law of God that trains us to say “no” to sin, or so we believe. He said that when we believe the gospel—the good news of what Christ has done for us—we become trained to follow Him in righteousness. When we look at what God the Father has done through God the Son, then God the Spirit changes us. Preaching to ourselves, the beauty of the gospel helps us to say “no” to the ugliness of ungodliness.\n\nI was glad I had that isolated cubicle, not only so I could listen to that sermon while working, but also because I was able to listen and then let the tears flow down without any embarrassment. You see, I had heard all this before, but until that day, I just kept forgetting. We come to Christ by believing the gospel of His grace. And we follow Christ by doing the same thing. \n\nThere are two kinds of people reading this. Some of you have never heard the full gospel. You have only heard that believing the gospel is how you become a Christian, but perhaps no one has ever told you that believing the gospel is also how you live as a Christian. The beauty of the rest of the gospel is that it actually teaches us how to turn from sin.\n\nSome of you are just like me; you’ve heard this before, but you keep forgetting. You forget the beauty. You forget the power of gazing on that beauty. My hope is that you are reminded today that when you are tempted to use the law to fight sin, the gospel is a better teacher of who we are in Christ and the life promised to us.\n\nWritten by Matthew B. Redmond\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day18.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Titus 1:1-16, Ephesians 4:11-13, Hebrews 6:13-20 ",
		"devo_title": "Titus’s Ministry",
		"devo_summary": "\nIn any type of leadership—whether in the home, the church, the workplace, a political office, or anywhere else—character should be an important component. Not only that, but leaders should be constantly aware of raising up other leaders. You won’t find any more fundamental rules of leadership than these two things.\n\nIn our passage today, Paul begins his letter to Titus with a few basic ground rules for being a pastor. He doesn’t tell Titus to work on his sermon illustrations or his building budget. He doesn’t tell him to dress a certain way or make sure he reads the right leadership books. Maybe these things have their place, but they aren’t fundamental to leadership in Paul’s mind.\n\nPaul starts with character. He tells Titus to be humble and self-controlled and sacrificial. He tells him to be bold in this leadership, protecting the people he leads and driving out evil and false teaching. False teachers are “unfit for any good work” (Titus 1:15).\n\nThese are strong words by Paul. He’s not raising up weak-minded pastors to be nonchalant about sin and heresy. He even tells Titus to be “blameless.” Now, surely, someone like Paul doesn’t mean that Titus should never sin. This is the same Paul who calls himself the “chief of sinners” (1 Timothy 1:15). He’d be quite the hypocrite if he told Titus to be sinless when no one can be—not even Paul (Romans 3).\n\nPaul is instead comparing two types of leaders: those who are fit for ministry due to their character and striving for truth, and those who are unfit due to their lack of character and striving for falsehood. The idea of blamelessness here refers more to a disposition or worldview rather than pure sinlessness. In other words, God will use a humble, kind, sacrificial, and truth-seeking person, even in his or her weakness and imperfection.\n\nWhether you’re a pastor, parent, construction worker, school teacher, or astronaut, you’re called to lead. You don’t need a team of marketers reporting to you in order to be a leader. As Christians, we are called in every sphere of life to reflect Christ and teach His ways to others (Matthew 28:18-20). Jesus was perfect and sinless on your behalf; your job is to be “blameless” before others, to point people to the One who was perfect so you don’t have to be. That’s the type of leader—the type of person—God will use.\n\nWritten by Brandon D. Smith\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day17.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 4:1-22, Deuteronomy 31:6-8, 1 Corinthians 9:24-27",
		"devo_title": "Keep the Faith",
		"devo_summary": "\nSome famous last words:\n\n“I can’t sleep.” – J.M. Barrie, author of Peter Pan.\n\n“I’ll finally get to see Marilyn.” – Joe DiMaggio, baseball player formerly married to Marilyn Monroe.\n\n“I give my soul to God, my body to the earth, and my worldly possessions to my nearest of kin, charging them to remember the sufferings of Jesus Christ.” – Michelangelo, painter.\n\nLast words are fascinating. We want to know: did the person say something meaningful? Did they summarize their life well? Though not everyone gets to choose the last thing they will say, some, when given the rare opportunity, make the most of it, like Michelangelo.\n\nToday’s Scripture reading from 2 Timothy includes Paul’s last recorded words. They are, of course, not the last words he spoke (presumably), but they are the last lines of the last existing letter he wrote before being martyred for his faith. So they are the last word we have from Paul. And I don’t know about you, but I love them. \n\nI love that Paul charges Timothy to preach the Word of God faithfully, noting that it will not always be a welcome message. I love that Paul reflects on his own life and concludes, before God, that he has run his own race to its end, and is finishing well. I love that he is ending his life with a lot of faithful friends around him. And I love that he asks Timothy to bring him his books and his coat because winter is coming. These last verses of 2 Timothy deal with both the theological and the practical—both of which are deeply spiritual.\n\nA few years back, I became seriously ill and had to put my own house in order. I recovered, but ever since then I’ve thought about the end of my own life quite a bit. I wonder what I will say, who will be around me, where I’ll be, and how I’ll experience the presence of God in that moment. There is an old Puritan prayer that makes me laugh, in which the writer asks God to let him die in a particular way. He writes: \n\n“Prepare me for death, that I may not die after long affliction or suddenly, but after short illness, with no confusion or disorder, and a quiet discharge in peace, with adieu to brethren. Let not my days end like lumber in a house, but give me a silent removing from one world to another.” \n\nI love the courage in those words, in essence, saying, If it’s all the same to you, Lord, let me go in this way. \n\nI suppose what I love most about both that old Puritan prayer and Paul’s last words in 2 Timothy is the way they express a confident hope that the gospel they’ve clung to all these years is still true, burning like a light that attracts these soon-to-depart brothers to their Maker.\n\nMay you and I, when we come to our own ends in this life, have such an affection for the Lord as Paul. May we not be questioning the truth of the gospel, but rather may we be chained to it. Until then, let me conclude with Paul’s last words from this letter: “The Lord be with your spirit. Grace be with you all” (2 Timothy 4:22).\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day16.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 3:1-17, Exodus 7:8-13, John 15:18-21",
		"devo_title": "Struggles in the Christian Life",
		"devo_summary": "\nNot long after my wife and I moved to Colorado, we became increasingly excited about exploring the foothills and peaks along the front range of the Rocky Mountains. One particular Saturday morning, we set out on a hike that had been recommend to us by a few trusted friends. Since they were Colorado natives and more adventurous than most, we naturally trusted their suggestion and set out for what we hoped would be a memorable afternoon.\n\nThe hike started out pleasant enough, meandering paths through a wooded glade. Over time the trail began to slowly rise toward the summit. Pointing out gnarled trees and curiously spotted birds to one another, we hardly noticed the change in the slope. We laughed and lingered as we pleased. Several miles later, though, we questioned just how far we actually were from the peak.\n\nWe began to wonder, “Are we there yet?”\n\nThe gentle pitch had turned into an aggressive incline. The gnarled trees had become logs crossing and blocking our footpath. The soft breeze had become an unnaturally chilly wind. Our legs were tiring, and our spirits weren’t quite as chipper as when we’d set out. \n\nBefore either of us spoke it, we both were thinking it: “Maybe we should head back?” \n\nWe stopped to consider our options. Then we began to head back down, slowly weaving our way through the boulders and rocky outcroppings. \n\nA stranger passed by, heading uphill. “How was the view today?”\n\n“Oh,” I muttered, “we didn’t quite make it. Maybe next time.”\n\n“Are you serious?! You’re less than 500 yards from the top!” \n\nThis is precisely Paul’s spiritual concern for Timothy in our reading today, and it is still a spiritual concern for each us: that we would give up before we’ve completed the journey and falter before the finish. Paul cautions, “Continue in what you have learned and firmly believed” (1 Timothy 3:14). \n\nContinue. Sometimes that’s all we can do. It may not feel all that glamorous or exciting, but the call is to continue—not for the joy of each step, but for the wonder of what lies beyond.\n\nThanks to our encounter with that seasoned hiker, we turned back uphill. We continued. We completed the summit, and the views were more than worth the effort. Filled with awe and wonder, my wife and I rested in a moment of indescribable fulfillment. \n\nThrough the life, death, and resurrection of Jesus, we live a life and walk a journey characterized by grace and redemption. However, this does not mean the way is smooth or the journey is easy. We need only look at the life of Jesus to know this is true. The Christian life will ebb and flow through different seasons. Sometimes the way is easy and the burden feels light; others times the way is steep and perhaps overwhelming. \n\nIf you’ve come to know Jesus, then I pray that Paul’s challenge and encouragement sticks with you this week. Continue on. Continue on in what you know to be true. Continue on in who you know you were made to be. Continue on in the belief that the summit is closer than you think.\n\nIf your heart is heavy, if your feet are weary, if your back is sore, if you can’t go one step more, I pray a one-word prayer for you today: continue.\n\nWritten by Andrew Stoddard\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day15.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 3:16-17",
		"devo_title": "Weekly Truth",
		"devo_summary": "\nScripture is God-breathed and true. When we memorize it, we carry the good news of the gospel of Jesus with us wherever we go.\n\nThis week we will memorize the key verse for 2 Timothy. \n\nAll Scripture is inspired by God and is profitable for teaching, for rebuking, for correcting, for training in righteousness, so that the man of God may be complete, equipped for every good work.\n\n—2 Timothy 3:16-17\n\nSave the image below as a lock screen for your phone so you can read these words throughout the day. \n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/4-TimothyTitus-2.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "Galatians 5:22-23",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nBut the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. The law is not against such things.\n\n—Galatians 5:22-23\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day13.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 2:14-26, Galatians 5:22-25, 1 Peter 3:14-16",
		"devo_title": "An Approved Worker",
		"devo_summary": "\nMy teenage years were spent in prodigal living. I was horribly addicted to drugs by the time I was 17. After the Lord rescued and redeemed me, I heard someone liken false teaching to drugs. He said, “Heretics are like drug addicts. Those who do drugs think that they are doing themselves good, when, in fact, they are progressively destroying themselves. So, those who play with false teaching will be subject to its destructive influence.” This is an apropos illustration. False teaching has a progressively destructive influence on the life of the one who entertains it. \n\nQuite a number of theologians have insisted that if there were no false teaching, there would be no New Testament. So much of the New Testament is taken up with apostolic warnings about the many varieties of false teaching that had infiltrated the fledgling churches and threatened the spiritual life of those Christ had redeemed. Characteristic of the pastoral letters is the Apostle Paul’s insistence that ministers of the gospel must be on guard against the subtle ways in which false teaching wrecks havoc.  \n\nThe first thing we have to keep in mind is that words matter. There is no such thing as an inconsequential word. God spoke the world into existence by the Word of His power. He then spoke a Word to His image bearers about His intentions for them as residents of the habitable world over which He had given them dominion. If our first parents were to rightly interpret the newly created world in which they lived, they would need the Word of God to do so. After the fall, Adam and Eve needed God’s Word about the promise of redemption (Genesis 3:15). Listening to the revealed Word of God is the greatest need you and I have today. \n\nIt should then come as no surprise to us to discover that the attacks of the evil one are directed at the Word of God. After all, when he tempted our first parents, Satan’s first words were, “Did God really say…?” (Genesis 3:1). The power of this temptation lay in the fact that the evil one sought to convince our first parents that it was a noble task for them to question the truthfulness of the Word of God. This continues to be his most potent attack on the members of the Church today. \n\nMinisters of the gospel are “not to quarrel about words” (2 Timothy 2:14). Instead, they are to “avoid irreverent babble” that will “lead people into more and more ungodliness” (v. 16). There is a progressively destructive nature to false teaching. The more one entertains it—often under the guise of academic sophistication or open-mindedness—the more destructive influence it has on the minds, hearts, and lives of God’s people. \n\nBy way of contrast, the more we stay in the truth of God’s Word, the more it will impact our spiritual well-being. But, a failure to reject false teaching will cause those who propagate it to “swerve from the truth,” upsetting and weakening the faith of the members the Church (v. 18).\n\nWritten by Nick Batzig\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day12.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 2:1-13, Romans 6:5-10, 1 Corinthians 15:3-8",
		"devo_title": "Be Strong in Grace",
		"devo_summary": "\nThe smell and feel of a sunny spring afternoon always remind me of baseball. I fell out of love with baseball during the younger years of my adulthood because it didn’t have the excitement of college football or the NBA. As I have aged, however, I have come to appreciate baseball again, probably because baseball is more like real life than any other sport. You can be considered a legend in baseball while failing seven out of ten trips to the plate. Baseball season lasts for most of the year, yet division titles may be won by only one or two games, so a baseball player has to do little things well for the long haul. \n\nPaul’s vision of the Christian life in 2 Timothy 2:1-13 breathes this same ethos. He portrays the Christian as one who lives faithfully day in and day out, doing little things that no one notices. This is the thrust of every image he uses in verses 2-7. A teacher entrusts what he has heard to others not in a moment, but in a lifetime of faithful modeling and teaching. The soldier does not stand out in the crowd, but pleases the one who enlisted him and suffers for his service. The farmer toils in obscurity, but gets his reward in harvest time. The athlete who competes according to the rules works long hours to be prepared for his one shining moment.\n\nThis kind of slow faithfulness is difficult for those of us nurtured in youth groups where we were transported from one spiritual high to another, showing a burst of zeal for Jesus before going back to where we were. We find encouragement, though, when Paul says, “be strengthened by the grace that is in Christ Jesus” (2 Timothy 2:1). Nothing is more difficult than enduring faithfulness, but this burden causes us to despair of our own efforts and lay hold of the strength that only Christ can give. To live faithfully as a man each day requires a strength we do not possess. But God overflows with all the power we need and he gives it freely to those who call out for it.\n\nPaul closes by pointing us to Jesus Christ, who endured the pain of the cross for the joy set before Him and received the prize of His endurance. In the same way, we endure the difficulty of faithful Christian living but receive the joy of knowing Christ and enjoying His gifts, ultimately receiving our final reward: reigning as joint heirs with Christ. And so, we labor on, pleading for His strength to fill us and looking to our blessed hope.\n\nWritten by Scott Slayton\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day11.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Timothy 1:1-18, 2 Corinthians 3:4-6, 1 Thessalonians 5:16-22",
		"devo_title": "Not Ashamed of the Gospel",
		"devo_summary": "\nIt’s always amusing to me to see the guy at a football game wearing a paper bag over his head. Whether the New Orleans Saints of a prior generation, or our more recent lowly favorite, the Cleveland Browns, the bag-on-the-head guy gets one thing right: it’s embarrassing to root for a pathetically bad football team. \n\nThat might be how Timothy felt about his father in the faith, Paul. As Paul sat shackled to the wall of a dark prison cell in Rome, you have to wonder if Timothy was ready to find a bag to put over his head and walk away from his calling. Certainly, Paul felt that anxiety regarding Timothy. It’s why he tells him to “rekindle the gift of God that is in you” and “don’t be ashamed of the testimony about our Lord, or of me his prisoner” (2 Timothy 1:6, 8). On the surface, living and working for the sake of the gospel looks about as likely as the Browns having a winning season next year (spoiler alert: it’s not going to happen). \n\nYet, Paul knows why he is on the losing side of the ledger and he wants to convince Timothy that this is exactly where the victory is found. Though Christianity looks like a loss to the world, it is actually power, life, and immortality to those who believe. The Savior who was betrayed, rejected, and crucified is the one who abolished death and enabled Paul to endure the suffering and shame of Roman imprisonment. Paul knew whom he had trusted, and he knew Christ would not let him fall. \n\nPerhaps you feel like putting a bag over your head when it comes to displaying and declaring your faith in Christ. You fear what others will think about you, or even worse, what they may do to reject you. “Closet Christianity” seems to be a better way to go rather than being the guy publicly cheering on the “losing” squad week after week. Just as Paul told Timothy, so God’s Spirit says to us today, “Take off that paper bag! Don’t you know who your Savior is? Don’t you know the victory He has won? Don’t be ashamed! He has overcome! \n\nToday let’s take courage and lay down our timidity toward the gospel. There is a world waiting to hear good news, and a victorious King enabling us to persevere to the victory. \n\nWritten by Jeremy Writebol\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day10.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 6:2-21, Psalm 90:1-17, Matthew 27:11-14",
		"devo_title": "Guard the Heritage",
		"devo_summary": "\nHave you ever tried to log on to an old account, only to find you couldn’t remember your username or password? When you signed up, the name you wanted was already taken, so you came up with something close. Your usual password wasn’t secure enough, so you added some strange character at the end. Now you can’t recall either your username or password. The irony is these were supposed to protect sensitive information, but now not even you can get to it. Is this what is means to guard something? Sure, you kept your sensitive data out of the hands of criminals. Good job. But you also kept it from yourself. \n\nPaul tells Timothy to guard the gospel. What does this mean? \n\nTo guard the gospel is not only to discern and object to false teachings that might seek to undermine God’s truth, it is also to become intimately familiar with that truth ourselves. To guard the gospel is to know it—to see through the lens of it, to be increasingly aware of where we stand in relationship to God because of it. The gospel is more than a set of doctrinal distinctions—it is the truth of our relationship with the living Christ who loved us, and gave Himself for us (Galatians 2:20). \n\nPaul says the gospel is a heritage entrusted to Timothy, meaning it didn’t begin with Timothy or Paul, nor with any of us the day we first believed. Christians have a great spiritual heritage. Paul traces both his and Timothy’s spiritual lineage, saying the God he serves is the God of his forefathers—the same as the God of Abraham, whom Paul grew up studying as a Jew. Paul’s present conversion was a matter of recognizing God’s perfect fulfillment of His ancient covenant promises to Abraham in Christ.\n\nLater, Paul instructs Timothy to “rekindle the gift of God that is in you” (2 Timothy 1:6). Why would Paul tell Timothy to fan the call to gospel faithfulness into flame? Is it dying inside Timothy? No. Paul tells him this because the gospel is not something we embrace once and then leave alone like some username and password. We take it up, tend to it like a fire, and study it to learn of God’s grace and ponder Christ’s life, death, and resurrection. Though its power is already perfectly complete in Christ, we still need to hear it daily. \n\nThis is how we guard the gospel. We internalize it.\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day9.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 5:1-6:2a, Matthew 18:15-20, 1 Corinthians 7:39-40",
		"devo_title": "Support and Honor",
		"devo_summary": "\nIn his play Hamlet, Shakespeare’s Polonius famously declares: “This above all: to thine own self be true.” The phrase has its appeals, and at first glance seems like wise counsel. In fact, it appeals to something we are all naturally drawn to: a devotion to self, to our own sense of honor, to our own interests, often at the expense of genuine wisdom and careful consideration. We live in a “believe in yourself” world that tells us everything of value—everything worth doing—begins and ends with self. \n\nAs Paul reminds Timothy, however, though the idolatry of ego comes naturally to us, it is antithetical to the honor of God. Indeed, he says, one who is self-indulgent is dead, even while he lives. And, contrary to popular belief, the philosophy of self-focus and self-fulfillment is no barrier against abuse, favoritism, partiality, and all other societal ills. Fulfilling Paul’s injunction to show no favoritism can only be done when we honor God as God, and see ourselves not as victims who need to stand up for our own needs and wants, but as servants to one another, and to His kingdom.\n\nAt the center of this passage is an outward-looking vision: a concern for the kingdom, for the purity of the Church and the honor of God’s name. It is full of warnings against being caught up in worldly concerns that might overshadow and compromise the witness of the faith: maintain pure relationships in the household of God; support of those in need, but do not support idleness; honor those who have undertaken the care of the flock; do so without prejudice; and even, servants honor your masters, so that God’s name may not be blasphemed. Servants, honor your masters? How contrary this runs to all the wise counsel of our day!\n\nWe like to think that if we muster enough self-will and self-confidence, and if we all try really hard together, we can fix the ills of our world. As it turns out, however, the gospel is the only practical means by which hearts, lives, communities, and the world can be changed. No matter how many plans for social change man may offer, none can effectively change the world, because none can effectively change the human heart. \n\nThe life of the Church, therefore, must be among our chief concerns. There, in worship, we meet Christ. In the life of the body, we grow in Christ through the fellowship of the saints. Both judgment and blessing begin at the household of God. He enacts the extension of His kingdom through the Church, which is His body here on earth. Therefore, we must not be self-indulgent, or we are dead even while we live. Rather, we are to rest wholly upon Christ as we walk. He must be our chief desire, the fulfillment of our hearts, and the shaper of our lives.\n\nWritten by Caleb Faires\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day8.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "2 Peter 3:14-15",
		"devo_title": "Grace Day",
		"devo_summary": "\nUse this day to pray, rest, and reflect on this week’s reading, giving thanks for the grace that is ours in Christ.\n\nTherefore, dear friends, while you wait for these things, make every effort to be found without spot or blemish in his sight, at peace. Also, regard the patience of our Lord as salvation, just as our dear brother Paul has written to you according to the wisdom given to him.\n\n—2 Peter 3:14-15\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day6.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 4:1-16, Ecclesiastes 9:7-9, Colossians 2:16-23",
		"devo_title": "Instructions for Ministry",
		"devo_summary": "\nI don’t remember exactly how old I was when my mom told me I had to brush my teeth with soap, but I do remember where I was and what I’d said. I never used much bad language when I was a kid, so this was the first and only time I had to wash my mouth out with soap. Needless to say, it made an impact.\n\nI was running up the basement stairs after competing in some meaningless sport or other activity with my younger brother when I yelled down at him (apologies for the language), “Kyle, you are p$&%#ing me off!” I’d learned the phrase from a neighborhood kid a number of years older than me. I didn’t know what it meant, but I knew it was something you yelled at people when you were mad at them.\n\nThe neighborhood kid was not setting a good example in speech for me, his young friend. Unfortunately, we Christians often don’t do our part to set good examples for others in our lives either. Depending on how we are wired, most of us tend either toward legalism or licentiousness. That is to say, some Christians lean more toward pridefully following the rules, and some lean toward pridefully pushing the limits of what is allowed in our speech, our conduct, or otherwise.\n\nThankfully, as followers of Jesus, we know and must remind each other that our works do not save us. We rely on the grace of God in Christ alone to save us from our sin. But this glorious truth does not exempt us from living lives worthy of our salvation, setting good examples for all with whom we come in contact. First Timothy 4:12 says, “Set an example for the believers in speech, in conduct, in love, in faith, and in purity.” \n\nPractically speaking, what does this look like in our lives? It means we can’t beat ourselves up for not being shining examples of righteousness in every moment. But it also means we should seek to live lives worthy of Christ. Setting an example for others in our conduct really comes down to being mindful of our surroundings and our calling as Christians: to die to ourselves, sacrificing our perceived freedoms to become more like Jesus, walking in the freedom that can only come from knowing Him. \n\nAs we walk with Christ, we look to God’s Word to see how He conducts Himself, how He speaks, and how He lives, with the goal of imitating Him, by the power of the Holy Spirit.\n\nWritten by Chris Martin\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day5.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 3:1-16, Romans 9:15-24, Ephesians 2:8-9",
		"devo_title": "The Mystery of Godliness",
		"devo_summary": "\nI have a difficult time keeping surprises under wraps. I often give my children hints as to what their birthday and Christmas gifts will be. Even worse, my wife and I have a history of revealing gifts for one another before the proper time. There is excitement in knowing that giving the gift will result in bringing joy to the receiver—it’s almost too much to bear. Especially when the receiver is someone I love dearly.\n\nIt is no surprise that Paul exudes joy when he declares that “the mystery of godliness is great” (1 Timothy 3:16). The entirety of world history is riddled with religions where godliness is not a gift to be received, but a wage to be earned. It is staggering to think that millions of people have religiously worked throughout their lives to earn the title of “godly.” But the gospel, a gift from our good Father, explodes with earth-shattering news for weary people like you and me.\n\nAccording to Paul, godliness is not something we earn; it is a gift we receive. And at the right time, Jesus Christ came to offer this gift to those He dearly loves. In his letter to the Ephesians, the Apostle Paul declares,  “For you are saved by grace through faith, and this is not from yourselves; it is God’s gift—not from works, so that no one can boast” (Ephesians 2:8-9). This is the mystery of godliness! This is the content of the previously hidden, unwrapped gift. The gospel is God’s greatest gift to us, finally revealed: His plan for salvation through Jesus Christ.\n\nOne of the beautiful truths about this gift is that God gives us hints of it in every human heart. If anyone has ever tried to earn the title “godly” by their religious works, I would wager that deep down inside they know they do not measure up. There is the ever-present reminder of our failure. However, the mystery of godliness from the gospel brings a deep inner peace and joy that religious work cannot earn.\n\nIn this sense, “the mystery of godliness” means more than the initial good news of salvation. This is a gift that keeps on giving. Every day the gospel provides both salvation from our sin and peace from our failed efforts, but also the motivation to pursue godliness by God’s power and not our own. Our godliness does not earn our salvation. Our godliness is evidence of our salvation. We don’t rely on our works for salvation; we trust in Christ’s perfect work on our behalf. This is great news!\n\nTo put it another way, godliness is evidence that we are in Christ. It comes freely, flowing from Christ’s work in us. Once we grasp the goodness of this gift, we should all have a difficult time keeping this mystery under wraps. Think about it: God holds out to us the greatest gift that we could ever imagine! Reach out and receive joy and peace forevermore.\n\nWritten by Matt Capps\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day4.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 2:1-15, Deuteronomy 6:4, John 10:14-18, 2 Peter 3:14-16",
		"devo_title": "Instructions on Prayer",
		"devo_summary": "\nWhen I was in college a hurricane came through town and did a lot of damage. Roofs were stripped away by gale-force winds. Trees were toppled on homes and businesses. Some roads were closed for days. Afterward, I lived in a house with five other guys for days without power. It was all pretty exciting, really. Before the weather turned, I can remember waiting for the storm, but nothing was happening. We kept going outside, looking at the sky, but it was calm. All was quiet and peaceful, and we were disappointed.\n\nThere is a lot of teaching on prayer in 1 Timothy 2. Some of it is obvious. Other parts are challenging. Some is controversial. But there is one teaching here that, if we are not careful, we will pass by and miss something important.\n\nKeep in mind that Paul is mentoring Timothy, a young pastor. His letters to young Timothy are full of wisdom, instruction, commands, helpful advice, and encouragement. This is what you would expect from Paul, the older, more seasoned minister of the gospel, compared to one who was still a little wet behind the ears.\n\nRight before chapter 2 begins, Paul charges Timothy to hold on to his faith, to not be like others who have made a wreck of their faith. I mention this because the first words in this chapter are, “First of all, then…,” followed by instructions on prayer. And what is the end of those prayers? Why is this so important? So that we may “lead a tranquil and quiet life in all godliness and dignity” (v. 1).\n\nThink about that logic. \n\nHold onto the faith. Don’t shipwreck your life. You and your people need to pray for everyone so you may lead a quiet, peaceful life. \n\nWho teaches this? Most people teach that the way to an exciting life is not through quietly and prayerfully holding onto your faith. Most will teach you to live out loud for Jesus—to live boldly, implying that you need to make a ruckus for God. But Paul paints a different picture of what the prayers of a person of faith give us; those prayers lead to a quiet and peaceful life.\n\nQuiet and peaceful sound like nothing is happening. Quiet and peaceful sound boring, not exciting. Quiet can lead to a life in which, if excitement is the standard, disappointment is sure to follow. This can be hard for anyone who wants to live an exciting life. But for Christians, Paul seems to think link this quiet and peaceful life with godliness—with not wrecking our spiritual lives.\n\nWhy, though?\n\nBecause our culture and our flesh tell us that spirituality is where the action is. But Paul and the rest of the Scriptures show us that, as Eugene Peterson says, “Prayer gets us in on what God is doing.” The world is after action. God is after prayerful faith displayed in a quiet and peaceful life.\n\nWritten by Matthew B. Redmond\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day3.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 1:12-20, Acts 8:1-3, Acts 9:1-22",
		"devo_title": "Paul’s Testimony",
		"devo_summary": "\nChristians love dramatic testimonies. We’ve all been moved by brothers and sisters who tell stories of unfathomable sin and brokenness before coming to Christ. Many of these narratives move in excruciating detail through the kind of pain and wickedness some of us have only heard about second-hand. But the implication of their testimonies is clear: “If God can save someone like me, He can save you, too.”\n\nBut what about brothers and sisters who seem to have “boring” testimonies? What about those who grew up in a home where their parents loved them and told them about Jesus from the day of their birth? Almost with a sense of shame at the simplicity of it, they confess they knew they needed to be saved when they were young, trusted in Jesus, and have followed Him since. They might say they don’t even remember life before becoming a Christian. Compared to the stories of fights, drugs, and prison, these testimonies might seem lackluster. \n\nWriting in the early 1700s to give testimony to the amazing work of revival happening in his town, Jonathan Edwards spoke about two women with very different testimonies. One was a “company-keeper,” an 18th-century term for living a notorious life, and the other a four-year-old girl named Phoebe. Both came to see their desperate need for Christ and were gloriously saved. Edwards used their examples to make a simple point: No matter what a person’s background may be, we all need grace.\n\nPaul makes this point through the example of his own testimony in 1 Timothy chapter 1. He looked back at his life before the Damascus Road, and even though he was a “Pharisee of Pharisees” and a “Hebrew of Hebrews,” he had also been a “blasphemer, persecutor, and insolent opponent” who “acted ignorantly in unbelief.” After meeting Jesus, he looked at his present life and saw himself as someone who could never merit the favor of God because he was “the chief of sinners” (1Tm 1:12-20).\n\nYet, Paul saw something that was true about God much more clearly than he saw his own sin and unbelief: “The grace of our Lord overflowed” for him, as it does for us all. Paul pictured God’s grace as a mighty river, flowing toward him at a pace so fast and a force so strong that his own sin was no match for it. His sin and his self-righteousness had been overwhelmed “with the faith and love that are in Christ Jesus” (1Tm 1:14).\n\nMany days, you will be tempted to think you have been so bad that grace could never reach you. Other days, the temptation will be to believe you’ve been so good that grace is beneath you. Therefore, on each and every day, take a long look toward the cross of Jesus Christ. There, you will remember how desperately you needed grace, and hear the good news that God is glad to freely give it to you.\n\nIn the end, every Christian has the same testimony: I need Jesus. He has freely accepted me. His grace is more than enough to sustain me with hope and joy throughout my journey.\n\nWritten by Scott Slayton\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day2.jpg"
	},
	{
		"book_title": "1 & 2 Timothy and Titus",
		"devo_passages": "1 Timothy 1:1-11, Psalm 119:1-7, Acts 16:1-5",
		"devo_title": "Timothy’s Ministry",
		"devo_summary": "\nDuring a recent visit with my parents, I climbed into their attic and brought down a few boxes of old photos. They’d been up there for at least 20 years, maybe more. In one box, I found pictures of my parents in their early twenties. Every time I see pictures of them from before I was born, I wonder who they were. What did they love? How did they spend their time? What kept them up a night? What made them laugh? How did they get from there to here?\n\nTime is a funny thing. We tend to think of people in terms of who they are to us now. But everyone has a story, and none of them are simple. Those stories shape us into who we are. They shape what we care about. The Apostle Paul’s letters to Timothy and Titus bear this out.\n\nFirst and 2 Timothy and Titus are Paul’s last letters—his swansong. He writes to his young protégés with the maturity and resolve of a man who knows his end is near. But within Paul’s Spirit-led words, we see reminders of the apostle when he was young—little literary snapshots that take us back to the days when he opposed Christianity and persecuted the Church. We read about his calling to follow Christ and his fight to preserve doctrine that is pure and true. We see a web of relationships forged over the years—some broken, some thriving.\n\nThe words we read in these letters have a tremendous amount of history and context behind them. Though they are addressed to individuals, they were written for the sake of all Christians everywhere. For the young believers who will one day become old, these letters exist to guide them along a journey that is faithful and true to the heritage of the gospel of Christ.\n\nPaul says “the goal of our instruction is love that comes from a pure heart, a good conscience, and a sincere faith” (1 Timothy 1:5). Here at the end of his life, Paul is seasoned in such a way that he knows what it takes to develop this sort of character. He is writing to a young pastor and congregation knowing what sort of training and trials most likely lie ahead for these Christians. Some of what lies ahead for them will be filled with joy; other parts will carry a lot of sorrow. But Paul’s primary concern in these letters is spiritual growth.\n\nOne goal of the Christian life is that we would grow and change—that we would become more like Jesus. As you read these letters, I pray the Lord would call to mind ways He has worked to make you more like Jesus. And may this time you spend in His Word add to that ongoing work.\n\nWritten by Russ Ramsey\n\n                ",
		"img_url": "https://hereadstruth.com/wp-content/uploads/2018/03/HRT-TimothyTitus-Shareimage-Day1.jpg"
	}
]